-- таблица учителей (teachers)

INSERT INTO teachers(last_name, first_name, patronymic, cool_guide)
VALUES ('Иванова', 'Мария', 'Ивановна', true),
       ('Циркуль', 'Альберт', 'Петрович', false),
       ('Попинс', 'Мэри', 'Джоновна', true),
       ('Присидайло', 'Пётр', 'Петрович', false),
       ('Компьютерщиков', 'Евгений', 'Евгеньевич', false),
       ('Ньютонова', 'Элла', 'Андреевна', true);

-- таблица предметов (subjects)

INSERT INTO subjects(subject_name)
VALUES ('Литература'),
       ('Математика'),
       ('Химия'),
       ('Английский'),
       ('Информатика'),
       ('Физика'),
       ('Физкультура'),
       ('История');

-- таблица классов (class)

INSERT INTO class(title, teacher_id)
VALUES ('11-А', 1),
       ('11-Б', 3),
       ('11-В', 6);

-- таблица учеников (students)

INSERT INTO students(first_name, last_name, address, date_of_birth,
                     class_id, phone_number)
VALUES ('Павел', 'Смайликов', 'ул. Цветная', '1992-02-15', 1, '123-45-67'),
       ('Ольга', 'Птицина', 'ул. Отдыха', '1992-01-25', 1, '123-54-32'),
       ('Сергей', 'Петренко', 'ул. Цветная', '1992-10-05', 1, '123-76-89'),
       ('Роман', 'Зайчук', 'ул. Науки', '1992-12-06', 1, '234-56-78'),
       ('Семён', 'Форумов', 'ул. Спортивная', '1992-08-17', 1, '213-43-21'),

       ('Эдуард', 'Грибский', 'ул. Науки', '1992-05-24', 2, '234-51-2'),
       ('Иван', 'Агапов', 'ул. Цветная', '1992-09-10', 2, '123-09-01'),
       ('Василиса', 'Прекрасная', 'ул. Отдыха', '1992-05-05', 2, '123-50-40'),
       ('Диана', 'Олеевская', 'ул. Науки', '1992-02-16', 2, '321-45-67'),
       ('Элеонора', 'Грищенко', 'ул. Спортивная', '1992-03-03', 2, '435-12-18'),

       ('Федор', 'Мандрыкин', 'ул. Спортивная', '1992-12-05', 3, '231-45-84'),
       ('Ольга', 'Хитрая', 'ул. Отдыха', '1992-04-04', 3, '127-63-22'),
       ('Игорь', 'Соболькин', 'ул. Отдыха', '1992-11-03', 3, '224-55-33'),
       ('Олег', 'Хватский', 'ул. Науки', '1992-02-23', 3, '224-11-78'),
       ('Лев', 'Гордиенко', 'ул. Цветная', '1992-03-08', 3, '225-77-82');

-- таблица преподаёт (leads)

INSERT INTO leads(teacher_id, subject_id, class_id)
VALUES (1, 1, 3),
       (1, 1, 2),
       (1, 8, 1),
       (1, 1, 1),
       (5, 5, 2),
       (5, 5, 1),
       (5, 5, 3),
       (6, 6, 3),
       (3, 4, 1),
       (4, 7, 3),
       (4, 7, 2),
       (4, 7, 1),
       (2, 2, 3),
       (2, 3, 2),
       (2, 2, 2);

-- таблица оценок (ratings)

INSERT INTO ratings(student_id, subject_id, rating)
VALUES (1, 1, 5),
       (1, 1, 5),
       (1, 1, 5),
       (1, 4, 3),
       (1, 4, 4),
       (1, 4, 4),
       (1, 8, 4),
       (1, 8, 4),
       (1, 8, 4),
       (1, 5, 4),
       (1, 5, 5),
       (1, 5, 5),
       (1, 7, 5),
       (1, 7, 5),
       (1, 7, 5);


-- вывод таблиц select

SELECT *
FROM teachers;

SELECT *
FROM subjects;

SELECT *
FROM class;

SELECT *
FROM students;

SELECT *
FROM leads;

SELECT *
FROM ratings;